// https://github.com/pixeltris/SonyAlphaUSB/blob/6b459641a2b7fa778e2a8acfa9067c841aca5f96/SonyAlphaUSB/WIALogger.cs#L861
// https://github.com/pixeltris/ModTMNF/blob/26f3953125743c34859bf5e4077047546d970ab5/ModTMNF/TrackmaniaLauncher.cs
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Runtime.InteropServices;
using System.Diagnostics;
using System.IO;
using System.Threading;

namespace YgoMasterClient
{
    enum GameLauncherMode
    {
        /// <summary>
        /// This is a great solution but I've previously observed issues with hooking early functions (i.e. WinMain)
        /// </summary>
        Detours,
        /// <summary>
        /// Steals the program entry point to inject very early
        /// </summary>
        StealEntryPoint,
        /// <summary>
        /// Inject into the process instead of launching it
        /// </summary>
        Inject
    }

    class GameLauncher
    {
        public const string TargetProcessName = "masterduel.exe";
        public const string LoaderDll = "YgoMasterLoader.dll";

        public static unsafe bool Launch(GameLauncherMode mode, params string[] args)
        {
            string exeDir = null;
            string dllPath = Path.GetFullPath(LoaderDll);
            string exePath = TargetProcessName;
            try
            {
                if (!File.Exists(dllPath))
                {
                    return false;
                }

            public string lpDesktop;
            public string lpTitle;
            public uint dwX;
            public uint dwY;
            public uint dwXSize;
            public uint dwYSize;
            public uint dwXCountChars;
            public uint dwYCountChars;
            public uint dwFillAttribute;
            public uint dwFlags;
            public short wShowWindow;
            public short cbReserved2;
            public IntPtr lpReserved2;
            public IntPtr hStdInput;
            public IntPtr hStdOutput;
            public IntPtr hStdError;
        }

        struct PROCESS_INFORMATION
        {
            public IntPtr hProcess;
            public IntPtr hThread;
            public uint dwProcessId;
            public uint dwThreadId;
        }

        [StructLayout(LayoutKind.Explicit)]
        struct DEBUG_EVENT
        {
            [FieldOffset(0)]
            public uint dwDebugEventCode;
            [FieldOffset(4)]
            public int dwProcessId;
            [FieldOffset(8)]
            public int dwThreadId;

            // x64(offset:16, size:164)
            // x86(offset:12, size:86)
            [FieldOffset(16)]
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 164, ArraySubType = UnmanagedType.U1)]
            public byte[] debugInfo;

            public CREATE_PROCESS_DEBUG_INFO CreateProcessInfo
            {
                get { return GetDebugInfo<CREATE_PROCESS_DEBUG_INFO>(); }
            }

            public LOAD_DLL_DEBUG_INFO LoadDll
            {
                get { return GetDebugInfo<LOAD_DLL_DEBUG_INFO>(); }
            }

            private T GetDebugInfo<T>() where T : struct
            {
                GCHandle handle = GCHandle.Alloc(this.debugInfo, GCHandleType.Pinned);
                T result = (T)Marshal.PtrToStructure(handle.AddrOfPinnedObject(), typeof(T));
                handle.Free();
                return result;
            }
        }

        [StructLayout(LayoutKind.Sequential)]
        struct LOAD_DLL_DEBUG_INFO
        {
            public IntPtr hFile;
            public IntPtr lpBaseOfDll;
            public uint dwDebugInfoFileOffset;
            public uint nDebugInfoSize;
            public IntPtr lpImageName;
            public ushort fUnicode;
        }

        [StructLayout(LayoutKind.Sequential)]
        struct CREATE_PROCESS_DEBUG_INFO
        {
            public IntPtr hFile;
            public IntPtr hProcess;
            public IntPtr hThread;
            public IntPtr lpBaseOfImage;
            public uint dwDebugInfoFileOffset;
            public uint nDebugInfoSize;
            public IntPtr lpThreadLocalBase;
            public IntPtr lpStartAddress;
            public IntPtr lpImageName;
            public ushort fUnicode;
        }

        [StructLayout(LayoutKind.Explicit, Size = 1232)]
        unsafe struct CONTEXT64
        {
            // Register Parameter Home Addresses
            [FieldOffset(0x0)]
            internal ulong P1Home;
            [FieldOffset(0x8)]
            internal ulong P2Home;
            [FieldOffset(0x10)]
            internal ulong P3Home;
            [FieldOffset(0x18)]
            internal ulong P4Home;
            [FieldOffset(0x20)]
            internal ulong P5Home;
            [FieldOffset(0x28)]
            internal ulong P6Home;
            // Control Flags
            [FieldOffset(0x30)]
            internal CONTEXT_FLAGS ContextFlags;
            [FieldOffset(0x34)]
            internal uint MxCsr;
            // Segment Registers and Processor Flags
            [FieldOffset(0x38)]
            internal ushort SegCs;
            [FieldOffset(0x3a)]
            internal ushort SegDs;
            [FieldOffset(0x3c)]
            internal ushort SegEs;
            [FieldOffset(0x3e)]
            internal ushort SegFs;
            [FieldOffset(0x40)]
            internal ushort SegGs;
            [FieldOffset(0x42)]
            internal ushort SegSs;
            [FieldOffset(0x44)]
            internal uint EFlags;
            // Debug Registers
            [FieldOffset(0x48)]
            internal ulong Dr0;
            [FieldOffset(0x50)]
            internal ulong Dr1;
            [FieldOffset(0x58)]
            internal ulong Dr2;
            [FieldOffset(0x60)]
            internal ulong Dr3;
            [FieldOffset(0x68)]
            internal ulong Dr6;
            [FieldOffset(0x70)]
            internal ulong Dr7;
            // Integer Registers
            [FieldOffset(0x78)]
            internal ulong Rax;
            [FieldOffset(0x80)]
            internal ulong Rcx;
            [FieldOffset(0x88)]
            internal ulong Rdx;
            [FieldOffset(0x90)]
            internal ulong Rbx;
            [FieldOffset(0x98)]
            internal ulong Rsp;
            [FieldOffset(0xa0)]
            internal ulong Rbp;
            [FieldOffset(0xa8)]
            internal ulong Rsi;
            [FieldOffset(0xb0)]
            internal ulong Rdi;
            [FieldOffset(0xb8)]
            internal ulong R8;
            [FieldOffset(0xc0)]
            internal ulong R9;
            [FieldOffset(0xc8)]
            internal ulong R10;
            [FieldOffset(0xd0)]
            internal ulong R11;
            [FieldOffset(0xd8)]
            internal ulong R12;
            [FieldOffset(0xe0)]
            internal ulong R13;
            [FieldOffset(0xe8)]
            internal ulong R14;
            [FieldOffset(0xf0)]
            internal ulong R15;
            // Program Counter
            [FieldOffset(0xf8)]
            internal ulong Rip;
            // Floating Point State
            [FieldOffset(0x100)]
            internal ulong FltSave;
            [FieldOffset(0x120)]
            internal ulong Legacy;
            [FieldOffset(0x1a0)]
            internal ulong Xmm0;
            [FieldOffset(0x1b0)]
            internal ulong Xmm1;
            [FieldOffset(0x1c0)]
            internal ulong Xmm2;
            [FieldOffset(0x1d0)]
            internal ulong Xmm3;
            [FieldOffset(0x1e0)]
            internal ulong Xmm4;
            [FieldOffset(0x1f0)]
            internal ulong Xmm5;
            [FieldOffset(0x200)]
            internal ulong Xmm6;
            [FieldOffset(0x210)]
            internal ulong Xmm7;
            [FieldOffset(0x220)]
            internal ulong Xmm8;
            [FieldOffset(0x230)]
            internal ulong Xmm9;
            [FieldOffset(0x240)]
            internal ulong Xmm10;
            [FieldOffset(0x250)]
            internal ulong Xmm11;
            [FieldOffset(0x260)]
            internal ulong Xmm12;
            [FieldOffset(0x270)]
            internal ulong Xmm13;
            [FieldOffset(0x280)]
            internal ulong Xmm14;
            [FieldOffset(0x290)]
            internal ulong Xmm15;
            // Vector Registers
            [FieldOffset(0x300)]
            internal ulong VectorRegister;
            [FieldOffset(0x4a0)]
            internal ulong VectorControl;
            // Special Debug Control Registers
            [FieldOffset(0x4a8)]
            internal ulong DebugControl;
            [FieldOffset(0x4b0)]
            internal ulong LastBranchToRip;
            [FieldOffset(0x4b8)]
            internal ulong LastBranchFromRip;
            [FieldOffset(0x4c0)]
            internal ulong LastExceptionToRip;
            [FieldOffset(0x4c8)]
            internal ulong LastExceptionFromRip;
        }

        [Flags]
        enum CONTEXT_FLAGS : uint
        {
            i386 = 0x10000,
            i486 = 0x10000,   //  same as i386
            CONTROL = i386 | 0x01, // SS:SP, CS:IP, FLAGS, BP
            INTEGER = i386 | 0x02, // AX, BX, CX, DX, SI, DI
            SEGMENTS = i386 | 0x04, // DS, ES, FS, GS
            FLOATING_POINT = i386 | 0x08, // 387 state
            DEBUG_REGISTERS = i386 | 0x10, // DB 0-3,6,7
            EXTENDED_REGISTERS = i386 | 0x20, // cpu specific extensions
            FULL = CONTROL | INTEGER | SEGMENTS,
            ALL = CONTROL | INTEGER | SEGMENTS | FLOATING_POINT | DEBUG_REGISTERS | EXTENDED_REGISTERS
        }

        static class DllInjector
        {
            [DllImport("kernel32.dll", SetLastError = true)]
            static extern IntPtr OpenProcess(uint dwDesiredAccess, int bInheritHandle, int dwProcessId);

